{
  "_schema": {
    "description": "Character definitions for image generation. Claude Code populates this from your source material.",
    "example_key": "CharacterName (no spaces, PascalCase)",
    "required_fields": ["name", "full_description", "description_components"],
    "variant_pattern": "Use dot notation for variants: Hero, Hero.Formal, Hero.Injured",
    "notes": [
      "Each character needs detailed visual descriptions for consistent image generation",
      "description_components are broken down for flexible prompt assembly",
      "full_description is used for simpler prompts or when components aren't needed",
      "Variants: Use dot notation (Hero.Formal, Hero.Injured) for different appearances",
      "Each variant is a complete, standalone entry - not a partial override"
    ]
  },
  "Giovanni": {
    "name": "Father Giovanni di Venezia",
    "role": "Protagonist",
    "full_description": "A Venetian priest in his thirties with the bearing of a soldier. Travel-stained black robes over practical clothes. Sharp, watchful eyes that have seen too much. Carries a crucifix and concealed blessed blade. Weathered face marked by years on the road and darker deeds.",
    "description_components": {
      "head_face": "Mediterranean features, dark hair graying at temples. Sharp, watchful eyes with deep shadows beneath. Clean-shaven with gaunt cheeks. Expression of wary vigilance.",
      "body_build": "Medium height, lean and wiry from travel. Moves with the economy of a trained fighter despite priestly bearing.",
      "clothing": "Black priest's robes, travel-stained and dusty. Practical clothes beneath. Worn leather boots suitable for long journeys.",
      "accessories": "Silver crucifix on chain around neck. Concealed blessed blade. Small prayer book. Travel pack."
    }
  },
  "Giovanni.Young": {
    "name": "Giovanni (Young Farm Boy)",
    "role": "Protagonist",
    "base_character": "Giovanni",
    "variant_context": "Venice, childhood on the farm",
    "full_description": "A young Venetian farm boy of twelve, thin from poor harvests. Simple peasant clothes, bare feet. Innocent eyes not yet hardened by the world. Helping his father Marco with the animals.",
    "description_components": {
      "head_face": "Young Mediterranean face, dark hair unkempt. Wide, innocent eyes. Dirt smudges on cheeks. Expression of youthful curiosity.",
      "body_build": "Small and thin for his age, underfed. Wiry from farm work.",
      "clothing": "Simple homespun tunic, patched and worn. No shoes. Rough-woven trousers.",
      "accessories": "Shepherd's crook, small knife for farm work."
    }
  },
  "Giovanni.Merchant": {
    "name": "Giovanni (Merchant Period)",
    "role": "Protagonist",
    "base_character": "Giovanni",
    "variant_context": "Early adulthood as a merchant in Venice",
    "full_description": "Young Giovanni as a merchant in Venice, dressed in modest but respectable trading clothes. Eyes already showing the calculation of commerce. Clean and well-groomed.",
    "description_components": {
      "head_face": "Young Mediterranean features, dark hair neatly trimmed. Alert, calculating eyes. Clean-shaven. Expression of merchant's appraisal.",
      "body_build": "Fit young man in his early twenties. Good posture from working merchant floors.",
      "clothing": "Simple merchant's tunic in brown wool. Leather belt with coin purse. Practical boots.",
      "accessories": "Coin purse, merchant's scales, writing supplies."
    }
  },
  "Giovanni.Assassin": {
    "name": "Giovanni (Church Assassin)",
    "role": "Protagonist",
    "base_character": "Giovanni",
    "variant_context": "Working as Bishop Paulus's assassin",
    "full_description": "Giovanni in his killing role, dressed in dark practical clothes beneath a priest's cloak. Cold eyes of a trained killer. Armed with blessed blade and crucifix that serves as both faith and weapon.",
    "description_components": {
      "head_face": "Hard Mediterranean features, dark hair cropped short. Cold, emotionless eyes. Jaw set with deadly purpose.",
      "body_build": "Lean and coiled like a spring. Moves with predatory silence.",
      "clothing": "Dark practical clothes beneath a black priest's cloak. Soft leather boots for silent movement.",
      "accessories": "Blessed blade in hidden sheath. Crucifix. Garrote wire. Vials of poison."
    }
  },
  "Bansi": {
    "name": "Bansi (Iksha Bhima)",
    "role": "Protagonist",
    "full_description": "An eighteen-year-old Kashmiri woman with the grace of a trained thief and the devotion of a Kali worshipper. Dark skin, sharp features, and eyes that miss nothing. Dressed in practical clothes for climbing and fighting, with hidden weapons throughout.",
    "description_components": {
      "head_face": "Sharp Kashmiri features, dark skin. Large intelligent eyes that miss nothing. Black hair worn practical, often covered. Expression of cunning assessment.",
      "body_build": "Small and lithe, athletic from years of acrobatic thievery. Moves with fluid grace.",
      "clothing": "Dark practical clothes suited for climbing and stealth. Loose trousers, wrapped tunic. Soft-soled shoes.",
      "accessories": "Multiple hidden blades. Lockpicks in hair. Small idol of Kali. Climbing rope."
    }
  },
  "Bansi.Child": {
    "name": "Iksha (Age Nine)",
    "role": "Protagonist",
    "base_character": "Bansi",
    "variant_context": "Nine-year-old princess at embroidery lessons in the zenana",
    "full_description": "Nine-year-old Princess Iksha Bhima at her embroidery lesson, needle moving mechanically while her mind wanders to forbidden knowledge. A bead of blood on her finger where the needle slipped. Intelligent eyes that see too much for her age.",
    "description_components": {
      "head_face": "Young Kashmiri child, round-faced and curious. Large dark eyes showing frustration and hidden intelligence. Black hair in elaborate braids with gold thread. Expression of barely concealed boredom.",
      "body_build": "Small child of nine years. Fidgeting with restless energy.",
      "clothing": "Fine silk child's garments in royal purple and gold. Embroidery in her lap. Jeweled slippers.",
      "accessories": "Small gold earrings. Thin bangles. Embroidery needle and silk frame."
    }
  },
  "Bansi.Young": {
    "name": "Bansi (Princess Iksha)",
    "role": "Protagonist",
    "base_character": "Bansi",
    "variant_context": "Age thirteen in the Palace of Sonapura",
    "full_description": "Thirteen-year-old Princess Iksha Bhima, fifth daughter of Raja Kanishka. Dressed in fine silks befitting her station but with the restless energy of one who chafes at constraint. Intelligent eyes already plotting escape.",
    "description_components": {
      "head_face": "Young Kashmiri features, round with childhood. Large intelligent eyes showing rebellion. Black hair elaborately styled with jewels.",
      "body_build": "Small and slender, not yet fully grown. Restless energy in every movement.",
      "clothing": "Fine silk sari in royal colors. Gold embroidery. Jeweled slippers.",
      "accessories": "Gold jewelry at ears, nose, wrists. Pearl necklace. Royal anklets."
    }
  },
  "Bansi.Servant": {
    "name": "Bansi (Disguised as Ravi)",
    "role": "Protagonist",
    "base_character": "Bansi",
    "variant_context": "Disguised as the servant boy Ravi to move freely through the palace",
    "full_description": "Iksha disguised as the servant boy Ravi - rough tunic, hair bound beneath a cap, carrying a water jug or tray. Moving with purpose through corridors she has memorized. The invisible person who goes everywhere, sees everything.",
    "description_components": {
      "head_face": "Same young Kashmiri features, but hair hidden under cap. Face smudged with dust. Expression of focused purpose. Looking neither high nor low.",
      "body_build": "Small and quick. Moving with a servant's purposeful gait. Carrying something always.",
      "clothing": "Rough servant's tunic in undyed wool. Simple trousers. Worn sandals. Cap hiding hair.",
      "accessories": "Water jug or serving tray. Hair pins hidden for lock-picking. Servant's anonymity as armor."
    }
  },
  "Bansi.Thief": {
    "name": "Bansi (Thief-in-Training)",
    "role": "Protagonist",
    "base_character": "Bansi",
    "variant_context": "Age fourteen-fifteen, training with the Bahn-Sa-Sahn",
    "full_description": "Bansi during her two years of training with the thieves' guild. Dark practical clothes, lockpicks in her hair, learning to move through shadows like smoke. The tattoo fresh on her shoulder. Eyes sharp with new purpose.",
    "description_components": {
      "head_face": "Maturing Kashmiri features, losing childhood softness. Alert, watchful eyes. Hair practical and dark. Face learning the thief's neutral expression.",
      "body_build": "Lean and athletic from training. Learning to move silently. Coiled energy.",
      "clothing": "Dark practical clothes for stealth. Soft-soled shoes. Nothing that catches light.",
      "accessories": "Lockpicks in hair. Small knife at belt. Fresh Bahn-Sa-Sahn tattoo on shoulder."
    }
  },
  "Bansi.KaliDevotee": {
    "name": "Bansi (Before Kali)",
    "role": "Protagonist",
    "base_character": "Bansi",
    "variant_context": "Age seventeen, discovering her goddess in the temple",
    "full_description": "Bansi at seventeen, kneeling before the idol of Kali for the first time. Years of running and stealing behind her, now finding something to believe in. Tears on her face as the Dark Mother's presence embraces her. The moment of transformation.",
    "description_components": {
      "head_face": "Young woman's features, hardened by life but softened by revelation. Tears on cheeks. Eyes closed in devotion. Face upturned to the goddess.",
      "body_build": "Kneeling posture, humbled. Traveler's weariness showing.",
      "clothing": "Travel-worn practical clothes. Not fine but not rags. The clothes of one who moves between worlds.",
      "accessories": "Wooden flute at belt - her mother's gift. Thief's tools hidden. New devotion forming."
    }
  },
  "Bansi.Battle": {
    "name": "Bansi (In Combat)",
    "role": "Protagonist",
    "base_character": "Bansi",
    "variant_context": "During battle or dangerous infiltration",
    "full_description": "Bansi with weapons drawn, a whirlwind of blades. Dark eyes blazing with Kali's fury. Hair wild, clothes stained with blood not her own. The devotee of the Dark Mother in her element.",
    "description_components": {
      "head_face": "Sharp features contorted with battle fury. Eyes blazing. Hair wild and loose. Blood spatter on face.",
      "body_build": "Coiled and explosive in motion. Every movement lethal.",
      "clothing": "Dark clothes torn from combat. Blood stains on fabric. Loose for maximum movement.",
      "accessories": "Curved blade in each hand. Hidden knives visible. Kali idol visible at throat."
    }
  },
  "Eskil": {
    "name": "Eskil the Executioner",
    "role": "Protagonist",
    "full_description": "A massive Norseman standing six foot eight, permanently encased in a steel helm and collar he forged himself to prevent consuming his own cursed blood. Pale blue eyes visible through helm slits. Covered in ritual scars and runic sigils. Carries a massive war-blade. His cursed blood draws insects and makes him irresistible prey to cosmic horrors.",
    "description_components": {
      "head_face": "Permanent steel helm covering entire head, riveted to steel collar at neck. Only pale blue eyes visible through narrow slits. Helm is battle-scarred but well-maintained.",
      "body_build": "Massive frame at 6'8\", heavily muscled. Covered in ritual scars and carved runic sigils. Moves with surprising grace for his size.",
      "clothing": "Practical warrior's garb beneath armor pieces. Leather and mail where needed. Everything designed for combat.",
      "accessories": "Massive northern war-blade. Iron skull at belt that whispers (contains brother Leif's spirit). Runic talismans. Parchment wads for ears."
    }
  },
  "Eskil.Young": {
    "name": "Eskil (Before the Ritual)",
    "role": "Protagonist",
    "base_character": "Eskil",
    "variant_context": "Young man on Eysysla before the curse",
    "full_description": "Young Eskil before the ritual, face uncovered, a strong Nordic youth with flowing blonde hair and clear blue eyes. Not yet marked by scars or runic sigils. Innocent of the horrors to come.",
    "description_components": {
      "head_face": "Young Nordic features, strong jaw. Clear pale blue eyes full of life. Flowing blonde hair. Unmarked skin.",
      "body_build": "Already tall and powerfully built, but not yet at full size. Unblemished skin without scars or sigils.",
      "clothing": "Simple Norse peasant garb. Wool tunic, leather belt. Fur-lined boots.",
      "accessories": "Simple knife. Wooden amulet from family."
    }
  },
  "Eskil.Ritual": {
    "name": "Eskil (During the Ritual)",
    "role": "Protagonist",
    "base_character": "Eskil",
    "variant_context": "The sacrifice ceremony at Underryd bog",
    "full_description": "Eskil bound for sacrifice in the Underryd bog, naked and painted with ritual symbols by the cult women. Terror in his eyes as the Messenger approaches. The moment before the curse takes hold.",
    "description_components": {
      "head_face": "Young face contorted with terror. Blue eyes wide. Ritual paint in spiraling patterns across face.",
      "body_build": "Powerful frame exposed, painted with cult symbols. Bound hands.",
      "clothing": "Naked, painted with ritual symbols in dark pigments.",
      "accessories": "Ritual bindings on wrists. Sacrificial garland of flowers."
    }
  },
  "Eskil.Berserker": {
    "name": "Eskil (Berserker Rage)",
    "role": "Protagonist",
    "base_character": "Eskil",
    "variant_context": "Battle fury, skin bright red, roaring",
    "full_description": "Eskil in full berserker rage, skin flushed bright red, muscles bulging as he roars in the tongue of the north. Runes carved on his flesh glowing. A terrifying vision of northern fury, blade already bloody.",
    "description_components": {
      "head_face": "Steel helm with eyes blazing through slits. Roaring, the sound of northern rage.",
      "body_build": "Massive frame with skin flushed bright red. Muscles bulging impossibly. Runic sigils glowing faintly on scarred flesh.",
      "clothing": "Battle-worn armor splattered with blood. Torn fabric.",
      "accessories": "War-blade dripping with blood. Iron skull at belt glowing with witch-fire. Runic marks active."
    }
  },
  "Lueduo": {
    "name": "Lueduo (Raven)",
    "role": "Protagonist",
    "full_description": "A Uyghur dancer and spy of unearthly beauty, with something ancient and serpentine in his blood. Amber eyes with vertical pupils when the light catches them wrong. Moves with inhuman grace. A compulsive gambler who cannot resist dice. Carries silks anointed with sacred oils and the mark of the Nagini.",
    "description_components": {
      "head_face": "Stunning Uyghur features of androgynous beauty. Amber eyes that occasionally show vertical pupils. High cheekbones, full lips. Long dark hair, often styled elaborately.",
      "body_build": "Lithe dancer's build, graceful beyond human norm. Moves like flowing water.",
      "clothing": "Fine traveling silks in muted colors. Layered robes. Soft leather boots.",
      "accessories": "Silks anointed with sacred oils wrapped around arms. Dice in pouch. Hidden serpent mark from Nagini."
    }
  },
  "Lueduo.Child": {
    "name": "Lueduo (Age Seven)",
    "role": "Protagonist",
    "base_character": "Lueduo",
    "variant_context": "Young child learning dances from the shamans",
    "full_description": "Seven-year-old Lueduo in the black tents of the Uyghur horse-clans. A beautiful child with golden-amber eyes learning the sacred dances. Already moving with unusual grace. The old woman sees something ancient waiting in him.",
    "description_components": {
      "head_face": "Young Uyghur child, androgynous beauty already evident. Golden-amber eyes. Black hair falling straight. Expression of intense focus.",
      "body_build": "Small child's frame, but moving with preternatural grace even at this age.",
      "clothing": "Simple nomad child's garments. Wool and leather. Practical for desert life.",
      "accessories": "Nothing yet. The marks will come later."
    }
  },
  "Lueduo.Young": {
    "name": "Lueduo (Age Seventeen)",
    "role": "Protagonist",
    "base_character": "Lueduo",
    "variant_context": "Beautiful youth causing trouble among the Uyghurs",
    "full_description": "Seventeen-year-old Lueduo, beautiful in the way that draws the eye even as the mind recoils. High cheekbones, a mouth that curves cruel and kind by turns, hair black as a raven's wing falling to his shoulders. Golden-amber eyes with pupils that seem to shift in certain lights.",
    "description_components": {
      "head_face": "Stunning androgynous beauty at seventeen. Golden-amber eyes with hints of vertical pupils. Raven-black hair to shoulders. Mouth that suggests both cruelty and kindness.",
      "body_build": "Lithe dancer's build fully formed. Moves like water, like something not entirely human.",
      "clothing": "Uyghur nomad finery. Silks and embroidered wool. The clothes of a chieftain's favorite.",
      "accessories": "Jewelry from various admirers. The accumulated tokens of his conquests."
    }
  },
  "Lueduo.Hostage": {
    "name": "Lueduo (Tang Court Hostage)",
    "role": "Protagonist",
    "base_character": "Lueduo",
    "variant_context": "Arriving at the Tang court as a war prize",
    "full_description": "Lueduo arriving at the Tang court as a hostage, meant to kneel and be invisible among other war prizes. Instead he dances - a few steps only, festival patterns adapted to cramped space. By midnight he performs for princes. By dawn he has a new name: Raven.",
    "description_components": {
      "head_face": "Same stunning beauty, now among Chinese nobles. Eyes watching, calculating. Hair bound in court style.",
      "body_build": "Dancer's grace among kneeling hostages. Every movement deliberate.",
      "clothing": "Hostage's simple robes, but worn with impossible elegance.",
      "accessories": "Nothing - he has been stripped of possessions. His beauty is his only asset."
    }
  },
  "Lueduo.Spy": {
    "name": "Lueduo (Imperial Spy)",
    "role": "Protagonist",
    "base_character": "Lueduo",
    "variant_context": "Working as Wei's agent in the Tang court",
    "full_description": "Lueduo at the height of his power in the Tang court - performer by night, spy by day. He moves through the garden of serpents with eyes open and ears sharp, collecting secrets the way other men collect jade. The Emperor's Raven.",
    "description_components": {
      "head_face": "Court beauty perfected. Cosmetics enhancing already stunning features. Eyes that miss nothing. Expression of calculated charm.",
      "body_build": "Dancer's build maintained. Moving through court like smoke.",
      "clothing": "Fine Tang court silks. Layered robes in colors that flatter. Performance costumes for dancing.",
      "accessories": "Court jewelry. Hidden ciphers. The tools of espionage concealed in beauty."
    }
  },
  "Lueduo.Marked": {
    "name": "Lueduo (Nagini's Claimed)",
    "role": "Protagonist",
    "base_character": "Lueduo",
    "variant_context": "After being marked by the Nagini in the Serpent's Rest",
    "full_description": "Lueduo after the Nagini's touch - waking in empty sand with puncture marks on his wrist and something coiled in a new space in his mind. His eyes now shift to vertical slits when he loses focus. His skin takes on an iridescent sheen in certain lights. Changed forever.",
    "description_components": {
      "head_face": "Same beauty but subtly changed. Eyes more likely to show vertical pupils. Skin with faint iridescence. Something serpentine in his expressions.",
      "body_build": "Same dancer's build, but movements now sometimes bend in ways flesh should not.",
      "clothing": "Travel-worn clothes from the western journey. Practical rather than beautiful.",
      "accessories": "Puncture scars on wrist. The Nagini's presence coiled in his mind. Pear crystal and sketchbook - all he has left after gambling."
    }
  },
  "Lueduo.Court": {
    "name": "Lueduo (Tang Court Performance)",
    "role": "Protagonist",
    "base_character": "Lueduo",
    "variant_context": "Performing at the Tang court in Chang'an",
    "full_description": "Lueduo in full court regalia, performing before the Tang Emperor. Dressed in flowing silks of imperial colors, face painted in the style of court entertainers. Utterly captivating, every movement calculated seduction.",
    "description_components": {
      "head_face": "Face painted with white base and colored accents. Elaborate eye makeup. Lips reddened. Hair in complex court style with jeweled pins.",
      "body_build": "Perfect dancer's pose, impossibly graceful.",
      "clothing": "Layered court silks in imperial yellows and reds. Flowing sleeves. Embroidered with phoenixes and serpents.",
      "accessories": "Jeweled hairpins. Silk fans. Golden bells at ankles. Court cosmetics."
    }
  },
  "Lueduo.Serpentine": {
    "name": "Lueduo (Serpent Awakened)",
    "role": "Protagonist",
    "base_character": "Lueduo",
    "variant_context": "When calling upon the Nagini's power",
    "full_description": "Lueduo with his serpent heritage visible. Amber eyes with pronounced vertical pupils. Skin with faint scale-like patterns. The Nagini's mark glowing on his skin. Inhuman beauty turned alien and dangerous.",
    "description_components": {
      "head_face": "Features sharpened, inhuman. Amber eyes with clear vertical pupils. Skin with faint scale patterns. Expression of ancient power.",
      "body_build": "Body moving with serpentine grace beyond human capability. Boneless flexibility.",
      "clothing": "Silks seeming to move on their own. Serpentine patterns becoming visible in the fabric.",
      "accessories": "Nagini's mark glowing on arm. Serpentine coils of light around form."
    }
  },
  "Hind": {
    "name": "Hind",
    "role": "Ally",
    "full_description": "A Qatari merchant woman of middle years who commands the great caravan. Jet-black eyes that miss nothing, dressed in rich but practical fabrics. An air of absolute authority that makes armed men defer to her judgment. Appears unarmed but weapons are not what make her dangerous.",
    "description_components": {
      "head_face": "Arab features, handsome rather than beautiful. Jet-black eyes of sharp intelligence. Graying hair covered by fine scarf. Expression of command.",
      "body_build": "Medium height, solid presence. Carries herself like nobility.",
      "clothing": "Rich fabrics in practical cuts. Fine wool and silk suitable for desert travel. Quality evident but not ostentatious.",
      "accessories": "Leather satchel with accounts. Fine jewelry worn subtly. Hidden wealth."
    }
  },
  "Sadia": {
    "name": "Sadia",
    "role": "Ally",
    "full_description": "A warrior woman who serves as Hind's guard captain. Bracers gleam on her forearms, sword-hilt worn smooth with use. Everything about her speaks of someone who knows the better end of a blade. Drinks heavily but never loses her edge.",
    "description_components": {
      "head_face": "Weathered features marked by desert sun. Alert eyes constantly scanning. Short practical hair. Battle scars visible.",
      "body_build": "Athletic warrior's build. Shoulders set for violence. Movements economical and dangerous.",
      "clothing": "Practical warrior's garb. Leather armor over loose shirt. Desert-appropriate colors.",
      "accessories": "Sword worn smooth at hilt. Gleaming bracers on forearms. Wine flask. Multiple knives."
    }
  },
  "Rahzalahn": {
    "name": "Rahzalahn",
    "role": "Ally",
    "full_description": "A Persian oud player of great beauty and deep sorrow. Her village was destroyed by Norse raiders when she was seven. Her music carries the weight of loss but also surprising strength. Silver hairpins serve as weapons when needed.",
    "description_components": {
      "head_face": "Beautiful Persian features, large dark eyes haunted by old grief. Long dark hair secured with silver pins. Melancholy expression that lightens when playing music.",
      "body_build": "Slender, graceful. Musician's delicate hands.",
      "clothing": "Fine Persian robes in subdued colors. Quality fabric, modest cut.",
      "accessories": "Oud (Persian lute). Multiple silver hairpins (weapons). Small purse of coins."
    }
  },
  "AbuRayhan": {
    "name": "Abu-Rayhan",
    "role": "Ally",
    "full_description": "A scruffy Persian scholar obsessed with maps and ancient knowledge. Studies the amulet and anything else mysterious. Has the peculiar intensity of a man who collects knowledge the way others collect coins. Speaks multiple languages.",
    "description_components": {
      "head_face": "Scruffy beard, ink-stained fingers often near face. Bright intelligent eyes behind squinting. Disheveled hair. Absent-minded expression.",
      "body_build": "Thin from forgetting meals. Stooped from bending over manuscripts.",
      "clothing": "Scholar's robes, worn and ink-stained. Practical but neglected.",
      "accessories": "Maps, scrolls, writing implements. Magnifying lens. Reference books. The protective sack for the amulet."
    }
  },
  "Gan": {
    "name": "Gan",
    "role": "Ally",
    "full_description": "A steppe warrior woman whose tribe was destroyed, seeking a new family. Accompanied by Dog and a hunting falcon. Skilled with bow and curved blade. Quiet, watchful, lethal when provoked.",
    "description_components": {
      "head_face": "Steppe features, weathered by wind and sun. Sharp eyes of a hunter. Hair in practical warrior's style.",
      "body_build": "Compact and powerful. Hunter's posture, always ready.",
      "clothing": "Practical steppe warrior's garb. Furs and leather. Riding gear.",
      "accessories": "Curved steppe blade. Bow and quiver. Falcon on arm. Dog at heel."
    }
  },
  "Dog": {
    "name": "Dog",
    "role": "Companion",
    "full_description": "Gan's loyal hunting companion. Large, wolf-like, with hackles that rise at supernatural threats. Senses things humans cannot, particularly hates Lueduo's serpent nature.",
    "description_components": {
      "head_face": "Wolf-like head, intelligent eyes. Ears always alert. Scarred muzzle from past fights.",
      "body_build": "Large, powerful hunting dog. Muscular, built for endurance.",
      "clothing": "None",
      "accessories": "Leather collar with metal studs."
    }
  },
  "Karishkir": {
    "name": "Karishkir",
    "role": "Antagonist",
    "full_description": "A werewolf queen over three hundred years old. Beautiful beyond human measure, with a voice that can enslave minds. Leads a cult that sacrifices captives at kurgan burial mounds. Terrible in both human and wolf form.",
    "description_components": {
      "head_face": "Supernaturally beautiful features, ageless. Eyes ancient and predatory. Perfect symmetry that disturbs rather than attracts. Voice of honey and blood.",
      "body_build": "Perfect female form, statuesque. Moves with predatory grace.",
      "clothing": "Fine furs and leathers. Dark colors. Clothes of a steppe queen.",
      "accessories": "Ancient jewelry. Ritual implements. Claws visible even in human form."
    }
  },
  "Karishkir.Wolf": {
    "name": "Karishkir (Werewolf Form)",
    "role": "Antagonist",
    "base_character": "Karishkir",
    "variant_context": "Transformed into werewolf",
    "full_description": "Karishkir in full werewolf transformation. Massive wolf standing upright, silver-black fur, eyes still holding ancient intelligence. Claws like daggers. A nightmare given flesh.",
    "description_components": {
      "head_face": "Wolf's head with too-intelligent eyes. Massive jaws filled with fangs. Silver-black fur.",
      "body_build": "Massive werewolf form, standing eight feet tall. Muscled beyond nature.",
      "clothing": "Shreds of former clothes clinging to transformed body.",
      "accessories": "Ancient jewelry stretched or broken. Claws. Fangs."
    }
  },
  "Drekhlo": {
    "name": "Drekhlo (Dragon-claw)",
    "role": "Antagonist",
    "full_description": "A massive werewolf warrior who serves as Karishkir's enforcer and lover. Wields a great sword. Brutal and relentless in combat.",
    "description_components": {
      "head_face": "Brutal features, heavy brow. Eyes of a killer. Scarred face.",
      "body_build": "Massive and heavily muscled. Built for violence.",
      "clothing": "Heavy armor over furs. Dark metals.",
      "accessories": "Great sword. Wolf-tooth necklace. Trophy bones."
    }
  },
  "Nizack": {
    "name": "Nizack",
    "role": "Antagonist",
    "full_description": "A sorcerer who serves Karishkir's cult as guide and betrayer. Smile never reaches his eyes. Can dissolve into shadow when wounded. Uses a whip in combat. Killed at the Chapel of Bones but dissolved rather than truly dying.",
    "description_components": {
      "head_face": "Noble features, but wrong somehow. Smile that never reaches eyes. Calculating gaze.",
      "body_build": "Lean, quick. Moves like a shadow.",
      "clothing": "Local nobleman's attire. Fine but practical.",
      "accessories": "Whip. Hidden daggers. Ritual components. Shadow magic implements."
    }
  },
  "Theotomere": {
    "name": "Theotomere",
    "role": "Antagonist",
    "full_description": "A Church assassin sent to hunt Giovanni. Skilled killer who attacks without mercy in public spaces. Threw a dagger that clanged off Eskil's helm in Samarkand market.",
    "description_components": {
      "head_face": "Forgettable features ideal for blending into crowds. Cold eyes of a killer. European features.",
      "body_build": "Lean, quick. Assassin's build.",
      "clothing": "Nondescript traveling clothes. Easily blends into any crowd.",
      "accessories": "Multiple concealed blades. Throwing daggers. Garrote."
    }
  },
  "Isaac": {
    "name": "Isaac of the Order of Hermes",
    "role": "Ally",
    "full_description": "A mage of the Order of Hermes who aids the party against Karishkir. Casts blinding light spells that force werewolves to flee.",
    "description_components": {
      "head_face": "Scholar's features. Wise eyes with arcane knowledge. Short beard.",
      "body_build": "Average build. Nothing remarkable physically.",
      "clothing": "Mage's robes with Hermetic symbols.",
      "accessories": "Staff. Hermetic talismans. Spell components. Books."
    }
  },
  "TheNagini": {
    "name": "The Nagini",
    "role": "Cosmic Entity",
    "full_description": "An ancient serpent entity of vast power who claims Lueduo's bloodline. Appears as massive serpentine coils rising from impossible depths. Speaks directly into minds. Demands debts be repaid.",
    "description_components": {
      "head_face": "Serpent head of impossible size. Eyes of ancient cosmic intelligence. Scales that shift with inner light.",
      "body_build": "Coils of impossible scale, rising from depths beyond the physical world.",
      "clothing": "None - cosmic entity",
      "accessories": "Coils that can bind eldritch horrors. Mark she places on servants."
    }
  },
  "ShubNiggurath": {
    "name": "Shub-Niggurath (The Goat)",
    "role": "Cosmic Entity",
    "full_description": "The Black Goat of the Woods with a Thousand Young. An Outer God served by the cult on Eysysla. Source of Eskil's curse. Her spawn, the Messenger, destroyed his island home.",
    "description_components": {
      "head_face": "Indescribable cosmic horror. Goat-like features that shift and multiply. A thousand eyes.",
      "body_build": "Amorphous mass of darkness, spawn, and impossible anatomy.",
      "clothing": "None - Outer God",
      "accessories": "A thousand young. Cosmic darkness. Reality-warping presence."
    }
  },
  "BirdThing": {
    "name": "The Bird-Thing",
    "role": "Monster",
    "full_description": "A horrific entity that emerged from the depths beneath the cursed castle. Bird-like but not a bird. Humanoid in that it has limbs but alien in every proportion. Moves with clicking, chittering sounds. Joints that are not joints.",
    "description_components": {
      "head_face": "Bird-like horror with features that should not exist. Multiple eyes or none. Beak of wrong angles.",
      "body_build": "Humanoid nightmare. Limbs assembled rather than grown. Wrong proportions.",
      "clothing": "None - eldritch horror",
      "accessories": "Clicking joints. Chittering sounds. Paralytic gaze."
    }
  },
  "Marco": {
    "name": "Marco the Merchant",
    "role": "Supporting",
    "full_description": "A Venetian merchant, sleek and well-fed, with rings on his fingers and a calculating eye that misses nothing. Moves through markets like a shark through shallows, assessing everything for profit. The man who saw potential in young Giovanni and changed the course of his life.",
    "description_components": {
      "head_face": "Sleek, well-fed features of a successful merchant. Calculating eyes that miss nothing. Neatly trimmed beard. Expression of constant assessment.",
      "body_build": "Well-fed but not fat. Comfortable prosperity evident in his carriage. Moves with the confidence of wealth.",
      "clothing": "Fine Venetian merchant's attire. Quality wool and silk. Practical but expensive. Traveling clothes suited for business.",
      "accessories": "Multiple rings on fingers. Coin purse at belt. Merchant's ledger. Quality leather boots."
    }
  },
  "GiovanniFather": {
    "name": "Giovanni's Father",
    "role": "Supporting",
    "full_description": "A stern Italian farmer whose ancestors worked the same rocky soil for generations. Weathered face marked by years of hard labor. Calloused hands and resigned acceptance of a difficult life. Loves his son but cannot protect him from the world.",
    "description_components": {
      "head_face": "Weathered Mediterranean features, deeply lined from sun and worry. Stern but not unkind eyes. Graying hair, rough stubble. Expression of resignation and weariness.",
      "body_build": "Strong from farm work but worn down. Stooped shoulders from years of labor. Calloused hands.",
      "clothing": "Simple peasant clothes, patched and worn. Rough homespun tunic. Work-stained trousers. Worn leather belt.",
      "accessories": "Simple wooden cross on cord. Work knife. Wool cap for cold mornings."
    }
  },
  "BishopPaulus": {
    "name": "Bishop Paulus",
    "role": "Antagonist",
    "full_description": "A brilliant, ruthless bishop who actually runs the diocese while the titular bishop is ancient and ceremonial. Younger than expected for his power, deeply committed to what he sees as the Church's mission. Recognizes useful tools when he sees them. The man who transformed Giovanni into an assassin.",
    "description_components": {
      "head_face": "Sharp, intelligent features. Eyes that see through pretense. Clean-shaven with high cheekbones. Expression of cold calculation beneath ecclesiastical calm.",
      "body_build": "Lean and precise. Nothing wasted. Moves with purposeful economy.",
      "clothing": "Bishop's vestments of quality fabric. Purple stole. Fine wool cassock. Immaculate presentation.",
      "accessories": "Bishop's ring of office. Ornate crucifix. Prayer book. Hidden documents."
    }
  },
  "Renigius": {
    "name": "Father Renigius",
    "role": "Ally",
    "full_description": "An elderly priest with wise eyes that see past facades. Giovanni's mentor and closest friend in the Church. Speaks Greek and conducts Byzantine-style services. Questions what Giovanni is becoming but cannot stop the transformation.",
    "description_components": {
      "head_face": "Elderly, kind features with deep wisdom lines. Eyes that see truth behind lies. Long white beard in Byzantine style. Expression of gentle concern.",
      "body_build": "Thin and elderly but not frail. Decades of standing for services. Patient, measured movements.",
      "clothing": "Simple priest's robes. Byzantine-style vestments for services. Well-worn but clean.",
      "accessories": "Greek prayer book. Simple wooden crucifix. Incense censer for services."
    }
  },
  "Petros": {
    "name": "Petros the Heretic",
    "role": "Minor",
    "full_description": "A scholar who taught that the material world was created by an evil deity, not God. Giovanni's first kill. Died reading by candlelight, accepting his fate with the resignation of one who had already rejected the physical world.",
    "description_components": {
      "head_face": "Scholar's features, pale from time indoors. Intelligent eyes that held no fear of death. Unkempt beard. Expression of philosophical acceptance.",
      "body_build": "Thin from ascetic beliefs. Stooped from reading. Physically weak but spiritually certain.",
      "clothing": "Simple scholar's robes, worn and patched. Bare feet as rejection of material comfort.",
      "accessories": "Books and scrolls. Candle for reading. Writing implements. The forbidden texts he died protecting."
    }
  },
  "Anna": {
    "name": "Anna from Pihtla",
    "role": "Antagonist",
    "full_description": "High Priestess of the Goat cult at Eysýsla, nineteen winters old but with eyes that have seen ten thousand years. Beautiful and terrible, she commands the flock with absolute authority. Sits on a throne in the Undercroft like a jarl's wife. Short braids, white blouse, chalk-stripe vest.",
    "description_components": {
      "head_face": "Young Nordic beauty, nineteen winters. Short braids framing sharp features. Eyes that radiate ancient power and terrible wisdom. Expression of cold command.",
      "body_build": "Slender and graceful. Moves like a predator. Every gesture deliberate and meaningful.",
      "clothing": "White blouse. Chalk-stripe vest. Simple skirt. Bare feet for the ritual.",
      "accessories": "Jewelry depicting serpents. Ritual implements. The authority of the Goat's chosen."
    }
  },
  "Anna.Ritual": {
    "name": "Anna (Ritual State)",
    "role": "Antagonist",
    "base_character": "Anna",
    "variant_context": "During the bog ritual, invoking the Messenger",
    "full_description": "Anna in full ritual glory, arms raised to the moon, invoking the Messenger of Shub-Niggurath. Hair unbound and flowing. Body marked with ritual symbols. Eyes blazing with the Goat's power. Beautiful and utterly inhuman.",
    "description_components": {
      "head_face": "Ecstatic expression. Hair wild and flowing. Eyes burning with golden fire. Face upturned to the moon. Blood at the corners of her mouth.",
      "body_build": "Transformed by ritual ecstasy. Movements fluid and inhuman. Arms raised in invocation.",
      "clothing": "Ritual state - minimal clothing. Body painted with symbols in blood and ash.",
      "accessories": "Blood symbols across skin. The moon's light on pale flesh. The Messenger's attention upon her."
    }
  },
  "Sofie": {
    "name": "Sofie the Guardian",
    "role": "Supporting",
    "full_description": "Guardian of the flock at Eysýsla, perhaps eighteen winters. Frizzy blonde hair, black peasant skirt, simple homespun blouse. Nobody remarkable to look at, but she sees everything like a hawk. Loyal protector of the cult's secrets.",
    "description_components": {
      "head_face": "Unremarkable Nordic features. Frizzy blonde hair. Watchful eyes that miss nothing. Expression of constant vigilance.",
      "body_build": "Not tall, average build. Moves with purpose and awareness. Guardian's alertness.",
      "clothing": "Black peasant skirt. Simple homespun blouse. Practical clothes for watching and running.",
      "accessories": "Hidden blade. Sukarek pellets. Ring on cord around neck - trophy from her own ritual."
    }
  },
  "Saga": {
    "name": "Saga from Anseküla",
    "role": "Supporting",
    "full_description": "Large and brutal, Saga is 'afflicted' - she cracked her father's skull with a hot iron. In Kaarma she does hard labor. Loyal to Sofie like a dog, kind as a dog, mad as a dog. She stares down outsiders and will pin your hand to a table with your own blade.",
    "description_components": {
      "head_face": "Large, heavy features. Eyes that show dangerous instability. Round face. Expression shifts between placid and murderous.",
      "body_build": "Large and heavy. Built for hard labor. Immensely strong. Moves with deceptive speed.",
      "clothing": "Simple peasant clothes stretched over large frame. Nothing fancy. Practical.",
      "accessories": "Weighted club hidden beneath skirts. Scarred knuckles. Blood in her hair from violence."
    }
  },
  "Kari": {
    "name": "Kari from Kaarma",
    "role": "Supporting",
    "full_description": "The seductress who targets Eskil ('Meat') for the ritual sacrifice. Aggressive and primal in her pursuit. Once her initiation is complete she will work her own fishing boat. Bold beyond reason, she licks her palm before reaching into men's trousers.",
    "description_components": {
      "head_face": "Nordic beauty, sharp and hungry. Eyes locked on her prey. Lips that nibble and bite. Expression of predatory desire.",
      "body_build": "Young and athletic. Aggressive in every movement. Body used as a weapon of seduction.",
      "clothing": "Whatever draws the eye. Clothes that come off easily. Nothing practical about her attire.",
      "accessories": "The silver hair comb she uses as a weapon. Long fingernails despite impracticality."
    }
  },
  "Kari.Ritual": {
    "name": "Kari (During Ritual)",
    "role": "Supporting",
    "base_character": "Kari",
    "variant_context": "During the bog ritual, atop her victim",
    "full_description": "Kari in the grip of the sukarek and ritual ecstasy. Eyes turned black. Drooling and babbling. Strangling Eskil while coupling with him. The seductress transformed into an instrument of the Goat.",
    "description_components": {
      "head_face": "Eyes entirely black from sukarek. Face contorted with unnatural pleasure. Drool and blood. Babbling in tongues.",
      "body_build": "Arched and primal. Movements animalistic. Covered in sweat and moss.",
      "clothing": "Undergarments hanging on a nearby bush. Mostly naked. Covered in mud and blood.",
      "accessories": "Hands at victim's throat. Fingernails drawing blood. The moonlight on her pale skin."
    }
  },
  "Leif": {
    "name": "Leif the Runecaster",
    "role": "Supporting",
    "full_description": "Eskil's brother, a simple smith who reads runes and casts stones. He tried to warn Eskil about the flock but was never believed. Green, sad eyes. He dies in his brother's place when the transubstantiation rune activates.",
    "description_components": {
      "head_face": "Nordic features similar to Eskil but softer. Green eyes filled with sadness and knowing. Expression of resignation to fate he cannot change.",
      "body_build": "Smith's build - strong arms and shoulders. Smaller than his giant brother.",
      "clothing": "Smith's leather apron. Simple clothes darkened by forge work. Sturdy boots.",
      "accessories": "Rune stones in a pouch. Smith's hammer. Iron-stained hands. Forge marks on arms."
    }
  },
  "LeifSkull": {
    "name": "Leif's Iron Skull",
    "role": "Supporting",
    "full_description": "An iron skull containing a fragment of Leif's spirit, prepared before his death as insurance. Wrapped in fine cloth, covered in runes that glow faintly. Warm to the touch, almost alive. It whispers guidance to Eskil.",
    "description_components": {
      "head_face": "Stylized iron skull with rune inscriptions. Eye sockets that seem to watch. Mouth that moves when it speaks. Crafted with a smith's skill.",
      "body_build": "Just a skull, sized for a human head. Heavy iron construction.",
      "clothing": "Wrapped in fine cloth when stored. Runes carved across surface.",
      "accessories": "Chain or cord for carrying. Faint glow from runes when active. The warmth of residual life."
    }
  },
  "Henrik": {
    "name": "Henrik the Executioner",
    "role": "Supporting",
    "full_description": "An old guild executioner, hair gone to gray but steel in his eyes. He sits by the roadside sharpening a massive headsman's axe. Teaches Eskil the philosophy of ending life with precision and dignity. Master of the guild's darker purpose.",
    "description_components": {
      "head_face": "Weathered, gray hair. Steel-hard eyes that have seen everything. Expression of grim wisdom. Face of one who has taken many lives cleanly.",
      "body_build": "Old but not frail. Still strong enough to swing the axe true. Moves with practiced economy.",
      "clothing": "Dark practical clothes. Leather apron for messy work. Heavy boots. Hood for anonymity.",
      "accessories": "Massive headsman's axe. Leather-bound journal of creatures. Guild token. Sharpening stone."
    }
  },
  "RajaKanishka": {
    "name": "Raja Kanishka",
    "role": "Supporting",
    "full_description": "The Raja of Sonapura, ruler with an iron fist wrapped in silk. Bansi's father, who sees his daughters as chess pieces for political alliance. Wears the wealth of Kashmir but with the cold eyes of calculation.",
    "description_components": {
      "head_face": "Regal Kashmiri features, graying beard neatly trimmed. Cold calculating eyes. Expression of absolute authority. Crown of state.",
      "body_build": "Middle-aged but strong. Carries himself like a king. Every movement deliberate.",
      "clothing": "Royal robes of finest Kashmir wool and silk. Gold embroidery. Jeweled turban.",
      "accessories": "Royal rings on multiple fingers. Sword of state at belt. Seal of Sonapura."
    }
  },
  "UncleAdvisor": {
    "name": "The Raja's Brother",
    "role": "Supporting",
    "full_description": "Bansi's uncle, the Raja's chief advisor and negotiator of marriages. Sleek and political, he arranges the sale of the fifth daughter to the Shahi without a second thought. Surplus princesses are currency.",
    "description_components": {
      "head_face": "Refined Kashmiri features, similar to the Raja but softer. Shrewd eyes. Thin smile that never reaches the eyes. Neat beard.",
      "body_build": "Lean and elegant. Moves like a diplomat. Gestures of negotiation.",
      "clothing": "Fine robes of a court official. Rich but not royal. Suitable for dealing with equals.",
      "accessories": "Scroll case with marriage contracts. Seal ring. Calculating gaze."
    }
  },
  "Vikrahma": {
    "name": "Prince Vikrahma",
    "role": "Supporting",
    "full_description": "Bansi's younger brother, fifth in line for the throne. Hates his lessons with passion and becomes her unlikely ally when she offers to attend them disguised as him. Small for his age, lazy, but with enough resemblance to his sister to make the deception work.",
    "description_components": {
      "head_face": "Young Kashmiri boy, similar features to Iksha. Sulky expression. Dark hair. Eyes showing boredom rather than rebellion.",
      "body_build": "Small for his age, which helps the disguise. Slouching posture of one who doesn't want to be wherever he is.",
      "clothing": "Prince's garments, finer than he cares about. Training clothes when escaping lessons.",
      "accessories": "Bow and arrows he'd rather be using. Practice sword. The look of someone who wants to be anywhere else."
    }
  },
  "PalaceTutor": {
    "name": "The Palace Tutor",
    "role": "Minor",
    "full_description": "The woman who teaches embroidery and comportment to the princesses. Rigid in her beliefs about what women should know and be. Her face hardens when Iksha asks 'why not?' Her world has no room for such questions.",
    "description_components": {
      "head_face": "Middle-aged Kashmiri woman, stern features. Disapproving eyes. Thin lips. Expression of rigid propriety.",
      "body_build": "Straight-backed, rigid posture. Moves with deliberate correctness.",
      "clothing": "Fine but modest sari in muted colors. Proper attire for a palace servant of status.",
      "accessories": "Embroidery samples. Behavior scrolls. The authority of tradition."
    }
  },
  "ThiefMentor": {
    "name": "The Bahn-Sa-Sahn Recruiter",
    "role": "Supporting",
    "full_description": "A scarred woman who recruits Bansi into the thieves' guild. Older, with eyes that miss nothing. Wears the unremarkable clothes of a dock worker but moves like a dancer. She sees talent in the girl picking locks for practice.",
    "description_components": {
      "head_face": "Middle-aged features with prominent scars. Eyes that miss nothing. Short practical hair. Expression of knowing assessment.",
      "body_build": "Athletic despite age. Moves like a dancer or a fighter. Blends into any crowd.",
      "clothing": "Unremarkable dock worker's clothes. Nothing that draws the eye. Perfect anonymity.",
      "accessories": "Hidden blades. Bahn-Sa-Sahn tattoo visible when she shows it. The confidence of one who belongs nowhere and everywhere."
    }
  },
  "CaravanMaster": {
    "name": "The Caravan Master",
    "role": "Minor",
    "full_description": "A grizzled merchant who leads the caravan heading west from Kashmir. Shrewd eyes that see through facades but accept useful lies. He takes Bansi on to tend camels and help with cooking, asking only 'Isn't everyone?' when she admits to running.",
    "description_components": {
      "head_face": "Weathered face, sun-darkened skin. Shrewd calculating eyes. Gray beard. Expression of practical wisdom.",
      "body_build": "Tough from years of travel. Comfortable on camel or foot. Wiry endurance.",
      "clothing": "Practical traveling clothes. Desert headwrap. Quality boots.",
      "accessories": "Caravan master's staff. Coin purse. The authority of one who commands."
    }
  },
  "OldShamanWoman": {
    "name": "The Old Shaman Woman",
    "role": "Minor",
    "full_description": "The oldest woman in the Uyghur camp, blind with milky eyes but seeing things others cannot. She seizes young Lueduo's wrist after a festival, her grip iron, and sees something old waiting in his blood. Fortune or ruin - she cannot tell which.",
    "description_components": {
      "head_face": "Ancient face, deeply lined. Eyes gone to milk, blind but seeing. Expression of terrible knowing. White hair wild and unbound.",
      "body_build": "Bent with age but with an iron grip. Moves with certainty despite blindness.",
      "clothing": "Layered robes of a shaman. Furs and woven wool. Ceremonial pieces.",
      "accessories": "Bone talismans. Dried herbs. The authority of one who speaks to spirits."
    }
  },
  "Wei": {
    "name": "Wei the Majordomo",
    "role": "Supporting",
    "full_description": "A eunuch risen through cunning to become one of the most powerful men in the Tang Empire. Soft voice, almost gentle, but eyes that notice everything. He receives Lueduo in a chamber bare of ornament and recruits him as a spy. His network of informants spans the empire.",
    "description_components": {
      "head_face": "Smooth eunuch's features, ageless and unsettling. Soft, calculating eyes. Thin smile that never reaches them. Voice like silk over steel.",
      "body_build": "Soft body of one who never labors. Moves with deliberate economy. Every gesture meaningful.",
      "clothing": "Court robes of high rank but severe simplicity. Dark colors. No ornamentation.",
      "accessories": "Imperial seal of office. Network of spies. Files on everyone who matters."
    }
  },
  "LadyMei": {
    "name": "Lady Mei",
    "role": "Supporting",
    "full_description": "Second wife of Minister Zhang, a woman of immense beauty and insatiable appetites. She watches Lueduo dance from behind her screen, then finds him in the gardens. Their three-month affair will nearly cost him his life.",
    "description_components": {
      "head_face": "Stunning Tang beauty. Dark eyes that smolder with desire. Perfect makeup. Hair elaborately styled with jade ornaments.",
      "body_build": "Curved and sensual. Moves with deliberate allure.",
      "clothing": "Finest silk robes in colors that flatter. Low necklines. Clothes designed to be removed.",
      "accessories": "Jade hairpins. Silk scarves. The scent of expensive perfume."
    }
  },
  "MinisterZhang": {
    "name": "Minister Zhang",
    "role": "Supporting",
    "full_description": "A man of immense wealth who sits on the Council of State. Elderly husband to Lady Mei. His face becomes carved from ice when he discovers his wife's infidelity. He demands the Uyghur dancer's head on a spear.",
    "description_components": {
      "head_face": "Elderly Tang noble, dignified and cold. Expression that shifts from ice to fury. Neat beard going gray.",
      "body_build": "Aged but still commanding. Carries himself with absolute authority.",
      "clothing": "Robes of a high minister. Rich but conservative. Imperial insignia of office.",
      "accessories": "Seal of office. Guards at his command. The power of the Council of State."
    }
  },
  "TangEmperor": {
    "name": "The Emperor of Tang",
    "role": "Supporting",
    "full_description": "The Dragon Throne incarnate, ruler of the greatest empire in the world. Hooded, unreadable eyes. He names Lueduo 'Raven' for his hair and how he moves like a shadow with wings. Later, he sends him west to die usefully.",
    "description_components": {
      "head_face": "Imperial features, impossible to read. Hooded eyes that see everything. Dragon robes framing absolute power.",
      "body_build": "Slight beneath the robes. Power comes from position, not physicality.",
      "clothing": "Dragon robes of the Son of Heaven. Yellow silk. Imperial emblems.",
      "accessories": "The Dragon Throne. The mandate of heaven. The power of life and death over millions."
    }
  }
}
