{
  "page_num": 43,
  "title": "The Strangers Intervene",
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "visual": "A heavy northern war-blade interposes itself between Theotomere and Giovanni. Eskil stands there, having crossed the market with the unhurried certainty of a man who expects the world to accommodate his passage. His pale blue eyes show no sympathy for either party.",
      "dialogue": "",
      "narration": "A blade interposed itself between the assassin and his prey.",
      "characters": [
        "Eskil",
        "Theotomere"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "Theotomere's thrown dagger clangs off Eskil's helm in a shower of sparks, pushing back his sackcloth hood. The dagger clatters to the packed earth. Eskil does not flinch. The helm's many holes reveal pale eyes beneath.",
      "dialogue": "",
      "narration": "Theotomere's thrown dagger clanged off the Norseman's helm in a shower of sparks.",
      "characters": [
        "Eskil",
        "Theotomere"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "Giovanni's hand finds his own blade - a poor thing compared to the assassin's weapon. He lunges, the movement more desperate than skilled. Theotomere parries easily, sneering.",
      "dialogue": "",
      "narration": "Giovanni's hand found his own blade—a poor thing compared to the assassin's weapon.",
      "characters": [
        "Giovanni",
        "Theotomere"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "visual": "Gan enters the fray, her curved steppe blade singing through the air. The blow bites into Theotomere's side. His eyes go wide with surprise. Blood stains his robes. Her falcon wheels overhead.",
      "dialogue": "",
      "narration": "Gan's curved blade sang through the air with the authority of the steppes behind it. The blow struck true.",
      "characters": [
        "Gan",
        "Theotomere"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}