{
  "page_num": 11,
  "title": "Prologue II: The Daughter of Shadows - The Gilded Cage",
  "layout": "3-top-wide",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Wide establishing shot of the Palace of Sonapura at dawn. Golden domes catching the first light of sunrise. The palace rises like a jeweled crown upon the brow of Kashmir, its towers reaching toward a sky painted in shades of rose and amber. Below, the city of Srinagar spreads out in shadowed slumber.",
      "dialogue": "",
      "narration": "In the high palace of Sonapura, where the Raja Kanishka ruled with an iron fist wrapped in silk, there lived a daughter who was not supposed to exist.",
      "characters": [],
      "location": "PalaceOfSonapura",
      "aspect_ratio": "16:9",
      "size": "1536x1024"
    },
    {
      "panel_num": 2,
      "visual": "Nine-year-old Iksha sits in the women's quarters, needle moving through silk with mechanical precision. The air is thick with incense. Around her, other daughters of the Raja bend over their embroidery. Light filters through latticed jali screens. A bead of blood wells on her fingertip where the needle slipped.",
      "dialogue": "",
      "narration": "Or rather, who existed only as a chess piece to be moved when the time came.",
      "characters": [
        "Bansi.Child"
      ],
      "location": "WomensQuarters",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "The tutor stands over Iksha with a disapproving expression. Through the latticed window behind them, the sound of male voices can be heard - brothers at their lessons in the courtyard below. Iksha's eyes are turned toward the window, away from her embroidery.",
      "dialogue": "PalaceTutor: \"Pay attention, Iksha. A lady does not concern herself with men's learning.\"",
      "narration": "",
      "characters": [
        "Bansi.Child",
        "PalaceTutor"
      ],
      "location": "WomensQuarters",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}