{
  "page_num": 31,
  "title": "Prologue IV: The Raven of the Emperor - The Black Tents",
  "layout": "3-top-wide",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Wide establishing shot of the Taklamakan desert at dusk. Black felt tents of the Uyghur horse-clans dot the endless sands. The sky burns orange and purple. In the distance, mountains rise like the spines of sleeping dragons. The sand whispers secrets to the patient and the mad.",
      "dialogue": "",
      "narration": "In the wastes of the Taklamakan, where the sand whispers secrets to the patient and the mad, there dwelt a people who remembered darker things than death.",
      "characters": [],
      "location": "TaklamakanCamp",
      "aspect_ratio": "16:9",
      "size": "1536x1024"
    },
    {
      "panel_num": 2,
      "visual": "Seven-year-old Lueduo learns the sacred dances from the clan shamans around a fire pit. His movements are already unnaturally graceful, his golden-amber eyes reflecting the flames. Other children watch in awe. The shamans nod to each other - this one is different.",
      "dialogue": "",
      "narration": "The shamans taught him the dances that were doorways. He learned them as a swordsman learns footwork - the movements mattered, the meaning did not.",
      "characters": [
        "Lueduo.Child"
      ],
      "location": "TaklamakanCamp",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "The oldest woman in the camp seizes young Lueduo's wrist after a festival, wrenching his palm toward the firelight. Her grip is iron. Her eyes are milk-white, blind but seeing. The flames behind her hiss and turn green. The child's face shows fear and wonder.",
      "dialogue": "OldShamanWoman: \"Something old waits in you, boy. Fortune or ruin. I cannot see which.\"",
      "narration": "",
      "characters": [
        "Lueduo.Child",
        "OldShamanWoman"
      ],
      "location": "TaklamakanCamp",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}