{
  "page_num": 20,
  "title": "The Dark Mother",
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Seventeen-year-old Bansi stands before a temple of Kali on the coast of India. Stone steps rise toward the entrance. Something has drawn her here - the ship she was working put in at this port, and she felt it like a pull in her chest. Home. Not Kashmir, not the palace, but the land itself.",
      "dialogue": "",
      "narration": "At seventeen, working a trading vessel, she put in at a port on the coast of India. Something stirred in her chest. The city drew her through crowded streets to a temple she did not remember seeking.",
      "characters": [
        "Bansi.KaliDevotee"
      ],
      "location": "TempleOfKali",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "Inside the temple, Bansi kneels before the idol of Kali - the Dark Mother with her garland of skulls, her tongue protruding, her multiple arms bearing weapons and symbols. Beautiful and terrible in equal measure. Oil lamps flicker. Incense smoke rises. Tears streak Bansi's face.",
      "dialogue": "Bansi.KaliDevotee: \"I am yours. Not my father's. Not any man's. Yours. If you will have me.\"",
      "narration": "",
      "characters": [
        "Bansi.KaliDevotee"
      ],
      "location": "TempleOfKali",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "A supernatural moment: Something vast and ancient seems to descend around Bansi like a mother embracing a child. The shadows in the temple seem to move with purpose. The idol's eyes seem to look directly at her, seeing every secret, every fear, every fierce joy. And accepting. A presence terrible and tender.",
      "dialogue": "",
      "narration": "She felt something then - a presence, vast and ancient and terrifying, that seemed to look directly into her soul. And then, like a mother embracing a wayward child, it accepted her.",
      "characters": [
        "Bansi.KaliDevotee"
      ],
      "location": "TempleOfKali",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "visual": "Present-day Bansi at eighteen stands in silhouette, blade at hip, wooden flute at her belt. She is complete now - thief and poet, sailor and scholar, devotee of the Dark Mother. She is no one's daughter, no one's wife, no one's property. Behind her, the world stretches to infinite horizons. She is Bansi. And she is free.",
      "dialogue": "",
      "narration": "She was a thief and a poet, a sailor and a scholar, a devotee of the Dark Mother who carried death at her hip and laughter in her heart. She was no one's daughter, no one's wife, no one's property. She was Bansi. And she was free.",
      "characters": [
        "Bansi"
      ],
      "location": "TempleOfKali",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}