{
  "page_num": 35,
  "title": "Lady Mei",
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Lady Mei watching Lueduo dance from behind a silk screen at a harvest banquet. Her dark eyes follow his every movement with predatory intensity. Jade ornaments gleam in her elaborate hair. Moonlight and lantern-light mingle.",
      "dialogue": "LadyMei: \"You move like water. Like something not entirely human.\"",
      "narration": "",
      "characters": [
        "LadyMei",
        "Lueduo.Spy"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "Lueduo and Lady Mei in a moonlit garden, against a pillar carved with dragons. Her silk robes are disheveled, her head thrown back. His face shows both passion and calculation. Dangerous beauty.",
      "dialogue": "",
      "narration": "Three months of stolen hours. He was fool enough to be flattered.",
      "characters": [
        "LadyMei",
        "Lueduo.Spy"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "The door crashes open. Minister Zhang stands flanked by guards with drawn swords, his face carved from ice. Lady Mei scrambles for sheets, bloodless with terror. Lueduo reaches for his robe. The trap springs shut.",
      "dialogue": "MinisterZhang: \"Silence.\"",
      "narration": "",
      "characters": [
        "LadyMei",
        "Lueduo.Spy",
        "MinisterZhang"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "visual": "Guards drag Lady Mei away as she screams, reaching desperately for Lueduo. He can only watch, helpless. Minister Zhang's eyes assess him like an insect. Her screams echo down the corridor into silence.",
      "dialogue": "MinisterZhang: \"You will confess. You will name them. And then you will die slowly.\"",
      "narration": "",
      "characters": [
        "LadyMei",
        "Lueduo.Spy",
        "MinisterZhang"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}