{
  "page_num": 41,
  "title": "Chapter 1: The Golden Road - Samarkand",
  "layout": "3-top-wide",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Wide establishing shot of the Samarkand markets sprawling beneath a sky the color of hammered brass. A labyrinth of silk tents and stone shops, goods from the ends of the earth displayed in chaotic profusion. Camels, merchants of every nation, bolts of colored silk hanging like banners. The sheer scale of the crossroads of the world.",
      "dialogue": "",
      "narration": "The markets of Samarkand sprawled beneath a sky the color of hammered brass, a labyrinth of silk and spice where a thousand tongues haggled over goods from the uttermost ends of the earth.",
      "characters": [],
      "location": "Samarkand",
      "aspect_ratio": "16:9",
      "size": "1536x1024"
    },
    {
      "panel_num": 2,
      "visual": "Father Giovanni di Venezia descends into the market crowd, his travel-stained robes marking him as a man of God. Weeks of Silk Road dust cling to him. His face shows exhaustion but also wonder at the bustling commerce. He is unaware of the figure following behind him.",
      "dialogue": "",
      "narration": "It was into this seething tide of humanity that Father Giovanni di Venezia descended.",
      "characters": [
        "Giovanni"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "A blade clears its sheath behind Giovanni - we see the assassin Theotomere emerging from the crowd, his face twisted with murderous intent. The blade gleams. Giovanni does not yet see him, but his posture suggests something has pricked at his awareness.",
      "dialogue": "",
      "narration": "He did not hear the blade clear its sheath behind him.",
      "characters": [
        "Giovanni",
        "Theotomere"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}