{
  "page_num": 43,
  "title": "Battle Erupts",
  "panel_count": 4,
  "is_spread": false,
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "annotation": "Bansi's challenge",
      "visual": "Bansi stands at the entrance to the bone cathedral, silhouetted against the darkness behind her. Her expression is a wild, savage grin - nothing of mirth in it. Multiple blades gleam in her hands. Her stance says she is ready to dance with death itself.",
      "dialogue": "Bansi: \"Come get a bone, little doggies.\"",
      "narration": "",
      "characters": [
        "Bansi.Battle"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "annotation": "Gan's arrow",
      "visual": "Gan draws and looses a flaming arrow. The shaft streaks across the chamber trailing fire. Her falcon dives alongside it, talons extended, going for Nizack's face. The firelight illuminates her determined expression.",
      "dialogue": "",
      "narration": "The battle erupted.",
      "characters": [
        "Gan"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "annotation": "Bansi frees Rahzalahn",
      "visual": "Bansi moves like smoke across the bone-strewn floor, tumbling beneath a cultist's wild swing. She comes up at the altar's edge, her blade singing twice to sever Rahzalahn's bonds. Rahzalahn's eyes are wide with desperate hope.",
      "dialogue": "Bansi: \"Go!\"",
      "narration": "",
      "characters": [
        "Bansi.Battle",
        "Rahzalahn"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "annotation": "Eskil vs Drekhlo",
      "visual": "Eskil charges toward Karishkir but Drekhlo intercepts him, the great sword clearing its sheath with terrible speed. Their blades meet in a shower of sparks, the impact ringing through the chamber. Two warriors of the North facing each other - one corrupted, one bearing the rune-inscribed collar fused to his flesh.",
      "dialogue": "",
      "narration": "Their blades met in a shower of sparks, the impact ringing through the chamber like a bell.",
      "characters": [
        "Eskil.Berserker",
        "Drekhlo"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}