{
  "page_num": 33,
  "title": "The Garden of Serpents",
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Lueduo dancing for nobles behind silk screens. Ministers and generals watch with hooded eyes. Concubines peek from behind lacquered panels. Candles cast golden light across the performance hall. His movements are hypnotic, mesmerizing.",
      "dialogue": "",
      "narration": "The court of the Dragon Throne was a garden of serpents, and Lueduo moved through it with eyes open and ears sharp.",
      "characters": [
        "Lueduo.Spy"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "Lueduo with a minister's daughter in an alcove, her silks disheveled, her lips at his ear whispering secrets. His face is calculating even in intimacy. Moonlight through latticed windows.",
      "dialogue": "",
      "narration": "The affairs began as opportunity. They told him things - complaints, names, secret alliances.",
      "characters": [
        "Lueduo.Spy"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "Split image showing Lueduo's hands: one copying documents by candlelight with a brush, the other accepting a jade ornament as a gift. Scrolls and ledgers surround him. Secrets made tangible.",
      "dialogue": "",
      "narration": "He collected secrets the way other men collected jade.",
      "characters": [
        "Lueduo.Spy"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "visual": "Lueduo's ledger of obligations - a web diagram showing connections between nobles, with notes in cipher. His finger traces a line between two names. The web grows more complex with each passing month.",
      "dialogue": "",
      "narration": "Information, properly leveraged, was worth more than gold.",
      "characters": [
        "Lueduo.Spy"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}