{
  "page_num": 64,
  "title": "The End of Nizack",
  "panel_count": 4,
  "is_spread": false,
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "annotation": "Karishkir escapes",
      "visual": "Karishkir throws Lüèduó aside like a discarded toy and dives toward a shimmering portal that Nizack has conjured. Drekhlo runs after her, pausing at the threshold to point his great sword back at Eskil. The portal crackles with eldritch energy, its edges unstable.",
      "dialogue": "Karishkir: \"Come, my love!\"",
      "narration": "",
      "characters": [
        "Karishkir",
        "Drekhlo"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "annotation": "Drekhlo's threat",
      "visual": "Drekhlo stands at the portal's edge, his great sword pointed at Eskil who bleeds from wounds across his chest. Drekhlo's expression is one of dark promise. Behind him, the portal shimmers with otherworldly light. His rune-marked body seems to pulse with power.",
      "dialogue": "Drekhlo: \"I have marked you, and when we meet again, I will drink your blood from your empty skull!\"",
      "narration": "",
      "characters": [
        "Drekhlo",
        "Eskil.Berserker"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "annotation": "Rahzalahn's revenge",
      "visual": "Nizack staggers in a circle, abandoned by his queen, blood running from multiple wounds. Behind him, Rahzalahn has crept up - her spiked silver hair comb now protruding from his throat. Her face shows no mercy, only grim satisfaction. Nizack's expression is one of utter betrayal and horror.",
      "dialogue": "",
      "narration": "She had crept up behind him during the chaos. Her spiked silver hair comb had found his throat.",
      "characters": [
        "Nizack",
        "Rahzalahn"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "annotation": "Nizack's dissolution",
      "visual": "Bansi and Lüèduó stand over Nizack's crumbling form, their silver daggers buried in his heart. His body is disintegrating - flesh charring and collapsing, consumed by invisible fire. Ash and embers spiral upward where a man once stood. His face is frozen in a final scream as he crumbles to nothing. The chamber is littered with cultist bodies behind them.",
      "dialogue": "",
      "narration": "The sorcerer's body did not simply die. It disintegrated - crumbling from within, the flesh charring and collapsing as if consumed by invisible fire.",
      "characters": [
        "Bansi.Battle",
        "Lueduo",
        "Nizack"
      ],
      "location": "ChapelOfBones",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}