{
  "page_num": 32,
  "title": "The Raven Ascends",
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Young Uyghur man in Tang court robes standing in a Chinese imperial hall. Long black hair, graceful bearing, golden-amber eyes. Other kneeling figures in background. Silk hangings and carved wood pillars.",
      "dialogue": "",
      "narration": "By seventeen he had become beautiful in the way that draws the eye even as the mind recoils.",
      "characters": [
        "Lueduo.Hostage"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "In the silence of the hall, where hostages are meant to kneel with lowered eyes, Lueduo dances. A few steps only - festival patterns adapted to the cramped space between kneeling bodies. The movement falls like stones into still water. Officials and princes freeze, watching.",
      "dialogue": "",
      "narration": "Instead of kneeling, he danced. In the silence of that hall, those steps fell like stones into still water.",
      "characters": [
        "Lueduo.Hostage"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "The Emperor of Tang on his Dragon Throne, hooded eyes watching the young Uyghur dancer. His mouth curves with something like appreciation. Around him, princes of the blood lean forward in fascination. Dawn light streams through silk screens.",
      "dialogue": "TangEmperor: \"Raven. For his hair, and for the way he moves. Like a shadow with wings.\"",
      "narration": "",
      "characters": [
        "TangEmperor",
        "Lueduo.Hostage"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "visual": "Lueduo rises through the court like a shadow ascending stairs of light. Split image: dancing for ministers, performing for concubines behind lacquered screens, moving through the garden of serpents with eyes open and ears sharp. The nobility compete for his presence.",
      "dialogue": "",
      "narration": "What followed was a season of ascent. From prisoner to performer, from performer to favorite.",
      "characters": [
        "Lueduo.Spy"
      ],
      "location": "TangCourt",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}