{
  "page_num": 17,
  "title": "The Bahn-Sa-Sahn",
  "layout": "3-bottom-wide",
  "panels": [
    {
      "panel_num": 1,
      "visual": "In a dark alley behind a merchant's storeroom, fourteen-year-old Bansi kneels before a lock, practicing her skills. Her picks move with practiced precision. Suddenly she becomes aware she is not alone. A voice speaks from the shadows behind her.",
      "dialogue": "ThiefMentor: \"Not bad technique. Little rough around the edges, but not bad.\"",
      "narration": "",
      "characters": [
        "Bansi.Thief"
      ],
      "location": "ThievesGuildSafe",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "Bansi spins, knife already in hand. The scarred woman steps from the shadows - older, with eyes that miss nothing. She wears the unremarkable clothes of a dock worker, but moves like a dancer. She is pulling down her collar, revealing a small tattoo on her shoulder.",
      "dialogue": "ThiefMentor: \"We're always looking for people with your particular skills. People who can blend in, move unseen. Come have a drink. No obligation.\"",
      "narration": "",
      "characters": [
        "Bansi.Thief",
        "ThiefMentor"
      ],
      "location": "ThievesGuildSafe",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "Wide shot: The tattoo ritual. Bansi sits perfectly still as the ink is worked into her skin - a small symbol mixed with something that burns. The scarred woman watches approvingly. Other guild members observe from the shadows. Pain shows on Bansi's face but she does not flinch. When it is done, she will no longer be alone in the world.",
      "dialogue": "ThiefMentor: \"Hurts like hell, but you won't forget it. And neither will we.\"",
      "narration": "Once marked, always marked. She would carry their sign on her skin and their training in her bones. Wherever she went in the world, there would be others who would know her as kin.",
      "characters": [
        "Bansi.Thief",
        "ThiefMentor"
      ],
      "location": "ThievesGuildSafe",
      "aspect_ratio": "16:9",
      "size": "1536x1024"
    }
  ]
}