{
  "page_num": 60,
  "title": "Chapter 3: The Amulet - The Pact",
  "panel_count": 3,
  "is_spread": false,
  "layout": "3-top-wide",
  "panels": [
    {
      "panel_num": 1,
      "annotation": "Wide - bonfire in courtyard",
      "visual": "Wide shot of the castle courtyard at night. A great bonfire blazes in the center, sending sparks spiraling up into a sky the color of old bruises. The ruined walls loom around them. The honest light of the fire pushes back the darkness. The party gathers around the flames, preparing for what lies within the keep.",
      "dialogue": "",
      "narration": "They built a bonfire in the castle's courtyard, more for defense than for warmth.",
      "characters": [],
      "location": "CursedCastle",
      "aspect_ratio": "16:9",
      "size": "1536x1024"
    },
    {
      "panel_num": 2,
      "annotation": "The pact",
      "visual": "Bansi lights a torch from the bonfire, her face determined. Around her, the others prepare - Giovanni praying quietly, Lueduo wrapping sacred silks around his arms, Abu-Rayhan murmuring invocations. Dog presses close to Gan's heel, hackles raised.",
      "dialogue": "Bansi: \"One day. We go in, we find what we came for, and we get out.\"",
      "narration": "",
      "characters": [
        "Bansi",
        "Giovanni",
        "Lueduo",
        "AbuRayhan",
        "Gan",
        "Dog"
      ],
      "location": "CursedCastle",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "annotation": "Spitting and shaking",
      "visual": "Close-up of hands meeting in the old compact - they spit and shake hands on it. Multiple hands visible from different party members, sealing the agreement. The firelight catches the determination in their eyes.",
      "dialogue": "",
      "narration": "No one disagreed. They spat and shook hands on it - the old compact of thieves and adventurers since time immemorial.",
      "characters": [
        "Bansi",
        "Giovanni",
        "Eskil",
        "Gan",
        "Lueduo",
        "Sadia"
      ],
      "location": "CursedCastle",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}