{
  "page_num": 19,
  "title": "The Thing in the Case",
  "layout": "3-right-tall",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Sixteen-year-old Bansi infiltrates a merchant's study on a moonless night. She moves through shadows, finding the locked drawer that yields to her picks in moments. The target ledger is in her hands. But the room contains other things - statuettes carved from greenish stone that feel too warm, almost pulsing. Scrolls covered in symbols that seem to writhe at the edge of vision.",
      "dialogue": "",
      "narration": "The assignment seemed simple: retrieve a ledger from a merchant who had cheated the Bahn-Sa-Sahn.",
      "characters": [
        "Bansi.Thief"
      ],
      "location": "MerchantStudy",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "Close on a glass case containing something that looks like dried fruit but is not - because it has a face. Withered and ancient, no larger than an infant's head. As Bansi watches, frozen in horror, its tiny mouth opens and closes as if trying to speak. A preserved child-thing from before alchemy was born.",
      "dialogue": "",
      "narration": "And in a glass case, something that looked like a dried piece of fruit but was not—could not be—because it had a face.",
      "characters": [],
      "location": "MerchantStudy",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "Tall panel: Bansi flees through the night, the ledger clutched to her chest. Behind her, the merchant's compound is a shadow against starless sky. Her face shows the first crack in her carefully constructed armor - she has seen something that cannot be unseen. The world is stranger than she thought, and it gets stranger still.",
      "dialogue": "ThiefMentor: \"The world is stranger than you think, girl. And the more you see of it, the stranger it gets.\"",
      "narration": "She fled. The ledger was delivered, the contract fulfilled. But that night she dreamed of tiny mouths opening and closing, speaking words in no human language.",
      "characters": [
        "Bansi.Thief"
      ],
      "location": "MerchantStudy",
      "aspect_ratio": "9:16",
      "size": "1024x1536"
    }
  ]
}