{
  "page_num": 55,
  "title": "The Cursed Village",
  "panel_count": 3,
  "is_spread": false,
  "layout": "3-top-wide",
  "panels": [
    {
      "panel_num": 1,
      "annotation": "Wide establishing - dead village",
      "visual": "Wide shot of the cursed village in the shadow of the ruined castle above. Fields lie fallow, crops rotting in the furrows. A well stands open at the village's edge. No smoke rises from any chimney, no children play in the dusty streets. Silence hangs over everything like a shroud. Mist begins to curl through the abandoned streets.",
      "dialogue": "",
      "narration": "Two days more brought them to the village that lay in the shadow of the cursed castle. The devastation announced itself before they ever reached the first house.",
      "characters": [],
      "location": "CursedVillage",
      "aspect_ratio": "16:9",
      "size": "1536x1024"
    },
    {
      "panel_num": 2,
      "annotation": "Nizack's betrayal",
      "visual": "Lueduo's eyes narrow with suspicion as Nizack speaks some innocuous observation. The quality of falseness beneath Nizack's words sets instincts screaming. In the background, Nizack is already slipping away into the mist, his form fading into shadow.",
      "dialogue": "Lueduo: \"We are about to be attacked.\"\nAbuRayhan: \"Traitor!\"",
      "narration": "",
      "characters": [
        "Lueduo",
        "Nizack",
        "AbuRayhan"
      ],
      "location": "CursedVillage",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "annotation": "The well of corpses",
      "visual": "Bansi peers down into the village well, her face illuminated from below by some pale light. Horror dawns in her eyes. Gan's falcon perches on the well's rim. The well is choked with corpses - a mass grave in the village's heart. The bodies are desiccated, dried out like leather.",
      "dialogue": "",
      "narration": "Corpses. The well was choked with corpses.",
      "characters": [
        "Bansi",
        "Gan"
      ],
      "location": "CursedVillage",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}