{
  "page_num": 64,
  "title": "The Dance",
  "panel_count": 4,
  "is_spread": false,
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "annotation": "Vines recoil",
      "visual": "Giovanni swipes at the nearest vine with his torch, and it retracts like a serpent recoiling from fire, pulling back toward the ceiling. The vines are alive. Gan nocks a flaming arrow, aiming into the darkness.",
      "dialogue": "",
      "narration": "Giovanni swiped at the nearest vine with his torch, and it retracted.",
      "characters": [
        "Giovanni",
        "Gan"
      ],
      "location": "UndergroundTemple",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "annotation": "Lueduo lights his silks",
      "visual": "Lueduo lights the silks wrapped around his arms. They catch with flames that burn true and golden - a small defiance against the corrupted light. His expression is focused, determined. He is about to dance.",
      "dialogue": "",
      "narration": "He lit the silks wrapped around his arms, and they caught with flames that burned true and golden.",
      "characters": [
        "Lueduo"
      ],
      "location": "UndergroundTemple",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "annotation": "The dance begins",
      "visual": "Lueduo dances through the chamber - whirling, stepping, slipping between grasping vines with inches to spare. The flames on his arms leave trails of afterimage in the darkness. His movements trace patterns the mind can follow only imperfectly. The vines reach for where he was rather than where he is.",
      "dialogue": "",
      "narration": "It was something older than either - a movement of the body that traced patterns the mind could follow only imperfectly.",
      "characters": [
        "Lueduo"
      ],
      "location": "UndergroundTemple",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "annotation": "At the altar",
      "visual": "Lueduo reaches the altar, facing the cyclopean figure behind it. The amulet lies on the altar's surface, inches from his fingers. His burning silks cast golden light against the darkness. Something vast and cold presses against his thoughts.",
      "dialogue": "",
      "narration": "Join us.",
      "characters": [
        "Lueduo"
      ],
      "location": "UndergroundTemple",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}