{
  "page_num": 42,
  "title": "Theotomere Strikes",
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "visual": "Giovanni lunges sideways on instinct alone, the assassin's blade singing through empty air where his spine was a heartbeat before. His eyes are wide with recognition and shock. Bolts of silk flutter around them from disturbed merchants.",
      "dialogue": "",
      "narration": "Giovanni lunged sideways on instinct alone, and the blade that should have opened his spine instead sang through empty air.",
      "characters": [
        "Giovanni",
        "Theotomere"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "Bansi at a textile stall, eyes sharp as she marks the commotion. Her stance shifts from casual browser to predator ready to strike. Her expression shows calculation - already planning her intervention.",
      "dialogue": "",
      "narration": "Across the market, a woman marked the commotion with sharp eyes.",
      "characters": [
        "Bansi"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "Bansi's foot kicks out at a tent pole with precision born of lightning reflexes. The colored silk canopy begins to collapse in a billow of fabric, descending toward Theotomere. Merchants scatter.",
      "dialogue": "",
      "narration": "Bansi kicked out at the nearest tent pole with precision born of lightning reflexes.",
      "characters": [
        "Bansi"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "visual": "Theotomere dances back from the falling fabric with the ease of a professional killer. The silk settles around him as he circles, seeking another opening. His expression is cold fury.",
      "dialogue": "Theotomere: \"Bastard!\"",
      "narration": "",
      "characters": [
        "Theotomere"
      ],
      "location": "Samarkand",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}