{
  "page_num": 61,
  "title": "Into the Keep",
  "panel_count": 4,
  "is_spread": false,
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "annotation": "Entering the darkness",
      "visual": "The party enters the keep, torchlight pushing back shadows that seem reluctant to yield. Giovanni prays quietly, Latin words a whispered thread. The architecture is inscrutable - proportions that shift when viewed from different angles.",
      "dialogue": "",
      "narration": "They moved as if entering a tomb, which perhaps they were.",
      "characters": [
        "Giovanni",
        "Bansi",
        "Lueduo"
      ],
      "location": "CursedCastle.Interior",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "annotation": "Eskil's warning",
      "visual": "Eskil clutches his shoulder where his protective sigils are carved, pain visible in his body language even through the helm. At his belt, the iron skull glows faintly. The walls around him seem to pulse with wrongness.",
      "dialogue": "",
      "narration": "Eskil felt it before he saw it - a stabbing pain in the sigils carved onto his shoulder.",
      "characters": [
        "Eskil",
        "LeifSkull"
      ],
      "location": "CursedCastle.Interior",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "annotation": "The bronze doors",
      "visual": "They reach massive bronze doors that glisten wetly in the torchlight, sweating some viscous substance. The floor before them is slick with oily sheen. The doors look organic, wrong - more flesh than metal.",
      "dialogue": "",
      "narration": "Bronze, or something like bronze, but the flickering torchlight revealed something deeply off with their surface.",
      "characters": [
        "Bansi",
        "Giovanni"
      ],
      "location": "CursedCastle.Interior",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "annotation": "Burning the doors",
      "visual": "Bansi and Giovanni press their torches to the bronze doors. The flame catches with unhealthy phlegm-green fire, spreading across the surface. The material does not melt - it disintegrates, sloughing away in burning globs like something organic dying.",
      "dialogue": "Bansi: \"Burn it.\"",
      "narration": "",
      "characters": [
        "Bansi",
        "Giovanni"
      ],
      "location": "CursedCastle.Interior",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}