{
  "page_num": 15,
  "title": "The Escape",
  "layout": "grid",
  "panels": [
    {
      "panel_num": 1,
      "visual": "In the abandoned guard tower, Iksha retrieves her hidden cache - coins stolen over months, clothes suitable for travel, a small knife. The last item she takes is a wooden flute her mother gave her years ago. The only thing she will keep from her old life.",
      "dialogue": "",
      "narration": "She had always known this day would come. Had prepared for it. Now she discovered she was not afraid. There was only cold, clear certainty.",
      "characters": [
        "Bansi.Young"
      ],
      "location": "PalaceOfSonapura",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 2,
      "visual": "In the servants' privy, Iksha transforms one final time into Ravi. Hair bound beneath cap, rough tunic, face smudged with dust. Her royal jewelry hidden in the bundle at her back. This disguise has worked a hundred times. This time it needs to work forever.",
      "dialogue": "",
      "narration": "No.",
      "characters": [
        "Bansi.Servant"
      ],
      "location": "PalaceOfSonapura",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 3,
      "visual": "Iksha walks past palace guards in broad daylight, just another servant on an errand. The guards who have seen her come and go a dozen times pay her no mind. She walks with purpose, carrying something, invisible as always.",
      "dialogue": "",
      "narration": "She would not go. She would not be sold like livestock.",
      "characters": [
        "Bansi.Servant"
      ],
      "location": "PalaceOfSonapura",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    },
    {
      "panel_num": 4,
      "visual": "The great gates of the palace. Iksha passes through them for the last time, stepping into the streets of Srinagar. Behind her, everything she was. Before her, everything she will become. In this moment, Princess Iksha Bhima dies. What walks into the city is someone new.",
      "dialogue": "",
      "narration": "Bansi. It meant 'flute' in the old tongue. A name for someone who would make her own music.",
      "characters": [
        "Bansi.Servant"
      ],
      "location": "SrinagarBazaar",
      "aspect_ratio": "3:4",
      "size": "768x1024"
    }
  ]
}